Repository: oscarahalvorsen/masterproject
Catalog: datacollecting/MAALFRID/tmx/datatilsynet.no.csv-en-nb.deduped.tmx
Source language: en
Languages: nb

source: This is why it is so important for regular scanning for vulnerabilities to be set up in all parts of the code, both in the underlying libraries and in the container setup.
nb: Det er derfor er viktig at det settes opp regelmessig skanning etter sårbarheter i alle deler av koden, både i underliggende biblioteker og kontaineroppsett.

source: This can be done using tools that send random and malformed data (incorrect input values) to all possible input fields in the software, either manually or using intelligent tools that analyse vulnerabilities in web applications.
nb: Dette kan gjøres ved å bruke verktøy som sender tilfeldig og misformet data (feil inputverdier) i alle mulige input-felt til programvaren manuelt, eller ved bruk av intelligente verktøy som analyserer sårbarheter i webapplikasjoner.

source: Demonstrate – The controller must be able to document compliance with the data protection regulation and security of processing.
nb: Den behandlingsansvarlige skal kunne dokumentere at den etterlever personvernregelverket og kravene til informasjonssikkerhet.

source: Schengen Information System II (SIS II)
nb: Schengen informasjonssystem (SIS II)

source: Provide an arena for knowledge exchange and network-building for
nb: Tilby en arena for kompetanseoverføring og nettverksbygging med

source: This includes requesting access to view, update, and/or delete their own data.
nb: Det innebærer blant annet rett til innsyn, korrigering og sletting av egne opplysninger.

source: (europarl.europa.eu), which includes an ethical framework for artificial intelligence.
nb: (europarl.europa.eu), som inkluderer et etisk rammeverk for kunstig intelligens.

source: Separate sensitive personal data from less sensitive personal data (in the database,
nb: Skill sensitive personopplysninger fra mindre sensitive personopplysninger (i databasen,

source: Separate tables in the database and associated access rights to tables and areas,
nb: Splitt tabeller i databasen og tilhørende tilgangsrettigheter til tabeller, samt områder, etter

source: In this day and age, it is possible to gather a lot of information about people who are insurance customers.
nb: I dag er det mulig å samle inn mye informasjon om folk som forsikringskunder.

source: Waxing Palace AS fined
nb: Gebyr til Waxing Palace AS

source: according to job necessity (the principle of least privilege).
nb: «tjenstlig» behov (minste privilegiums prinsipp).

source: access to sites, for clients and units, etc).
nb: tilgang til områder, på klienter og enheter med mer).

source: Consent must require the active participation of users:
nb: Samtykke skal kreve en aktiv handling fra brukere:

source: What is data protection by design?
nb: Innebygd personvern - hva er det?

source: If the incident includes a breach of confidentiality, integrity, or availability relating to personal data, the controller must be able to notify the Data Protection Authority within 72 hours, and the data subjects should be notified immediately if it likely to result in high risk to the rights and freedoms of the natural person.
nb: Dersom hendelsen omfatter konfidensialitet-, integritet- eller tilgjengelighetsbrudd relatert til personopplysninger skal virksomheten varsle Datatilsynet innen 72 timer og den registrerte skal varsles umiddelbart.

source: For example, unsafe functions and modules can in some cases be handled by tools such as
nb: Utrygge funksjoner og moduler kan for eksempel håndteres av bibliotek som

source: How to apply to join the sandbox?
nb: Hvordan søke om å delta i sandkassen?

source: The requirements identified during the requirements activity must be met, and requirements for the design must be defined.
nb: Kravene som ble satt i kravfasen skal ivaretas og det må defineres krav til designet.

source: This includes technical devices and procedures or operational or business matters, which, for reasons of competition, it is important for the organization to keep secret, see Section 13 of the Public Administration Act.
nb: Dette gjelder for eksempel tekniske innretninger og fremgangsmåter, samt drifts- eller forretningsforhold, som det vil være av konkurransemessig betydning å hemmeligholde for virksomheten, se forvaltningsloven § 13

source: The list of applicants was full of heavy players, says general manager Karl Trygve Kalleberg in Age Labs.
nb: Søkerlisten er full av tunge aktører, sier daglig leder Karl Trygve Kalleberg i Age Labs.

source: Processing activities included in the Norwegian DPA’s list
nb: Det finnes en rekke verktøy til hjelp ved vurdering av risiko.

source: In addition, the project will explore an important issue of principle in the KI context.
nb: I tillegg skal prosjektet utforske en viktig prinsipiell problemstilling i KI-sammenheng.

source: Security testing involves comprehensive testing of the software to discover vulnerabilities and to ensure that the code adequately safeguards security and data protection.
nb: Dette innebærer en omfattende testing av programvaren for å avdekke sårbarheter og for å være sikker på at koden ivaretar sikkerhet og personvern på tilstrekkelig måte.

source: During this activity, testers check that the requirements for data protection and information security defined during the Requirements and Design activities have been implemented as planned, as well as verify that the requirements have been properly met.
nb: I denne aktiviteten skal testere sjekke at personvernkrav og sikkerhetskrav som ble satt i krav- og designfasene faktisk er implementert.

source: The most important element of this activity is that the organisation has implemented a plan for incident response handling (prepared during the release activity) and follows it.
nb: Det viktigste i denne aktiviteten er at virksomheten har en plan for hendelseshåndtering (utarbeidet i produksjonssettingsfasen) og følger den.

source: Animation, video, and sound may be good tools for customising information to the user’s level of understanding.
nb: Animasjon, video og lyd kan være gode virkemidler for å tilpasse informasjonen til brukerens nivå for forståelse.

source: be at the mercy of Facebook and its terms and
nb: Vi mener at Datatilsynets tilstedeværelse på Facebook,

source: o error debugging, updating and patching of server and client software and
nb: o feilretting, oppdatering og patching av server- eller klientprogramvare og

source: During this activity, the specific types of training that should be given are determined.
nb: I denne aktiviteten bestemmes det hva det skal gis opplæring i.

source: Images were live-streamed on YouTube and the company’s own website.
nb: Det vart kringkasta live på Youtube og selskapets nettsider.

source: The software should be designed so that the data subject can exercise these rights as easily as possible.
nb: Programvaren bør designes slik at den registrerte kan ivareta disse rettighetene på enklest mulig måte.

source: This entails describing approved tools and associated security features that can help to automate and enforce security procedures in the coding.
nb: Dette innebærer å beskrive godkjente verktøy med tilhørende sikkerhetsfunksjonalitet som kan bidra til å automatisere og håndheve sikkerhetsrutiner i kodingen.

source: These cookies support our core functionality pertaining to security.
nb: som tilbyr megling som metode for å håndtere konflikter.

source: The sandbox operates with three main principles for responsible artificial intelligence:
nb: Sandkassen tar utgangspunkt i tre hovedprinsipper for ansvarlig kunstig intelligens:

source: Traceability makes both audits and explanations possible.
nb: Sporbarhet muliggjør både revisjon og forklaring.

source: of maintenance, service and operation.
nb: for forvaltning, drift og vedlikehold.

source: This can be done using code scanning tools.
nb: Dette kan gjøres ved å bruke verktøy for kodeskanning.

source: The overall objective of the Data Protection Authority’s regulatory sandbox is to promote the development and implementation of ethical and responsible artificial intelligence (AI) from a privacy perspective.
nb: Den overordnede målsetingen med den regulatoriske sandkassen i Datatilsynet er å stimulere til utvikling og bruk av etisk og ansvarlig kunstig intelligens (KI), fra et personvernperspektiv.

source: freedoms of data subjects in the processing
nb: PVO og validering av DPIA i ledelsen betraktes som

source: This includes planning for how the organisation effectively can handle incidents that may arise after release, as well as procedures for updating the software.
nb: Dette inkluderer planlegging for hvordan virksomheten effektivt kan håndtere hendelser som kan oppstå etter produksjonssetting, rutiner for oppdatering av programvaren og sikkerhetsgjennomgang før programvaren kan settes i produksjon.

source: It is also necessary to determine who will be responsible for the measure, and to set a deadline for implementation.
nb: Det må også fastsettes hvem som er ansvarlig for tiltaket og settes en frist for implementering.

source: A payslip is an example of a document which may contain sensitive personal data, and which must therefore be kept confidential.
nb: En lønnsslipp er et eksempel på et dokument som kan inneholde sensitive personopplysninger og som derfor krever konfidensialitet.

source: Security testing by challenging vulnerabilities in the software
nb: Sikkerhetstest ved å utfordre sårbarheter i programvaren

source: Norwegian DPA issues reprimand to Telenor for inadequate protection of personal data
nb: Irettesettelse til Telenor for manglende personopplysningssikkerhet

source: Read more on our page on laws and regulations
nb: Les mer på siden vår om lover og regler

source: This can be done by access control to tables containing personal data, splitting database tables, and distinguishing between components, units and areas with a high level of trust and those with a lower level of trust.
nb: Dette kan for eksempel gjøres i tilgangsstyringen til tabeller med personopplysninger, splitting av databasetabeller og ved å skille mellom enheter/områder som har høy tillit og lavere tillit.

source: made, as well as the ability for data subjects to demand manual processing.
nb: den registrerte til å kreve manuell behandling.

source: The Data Protection Officer and security advisor should also be involved in this activity.
nb: Personvernombud og sikkerhetsrådgiver bør også bidra i prosessen.

source: The company’s risk appetite may be documented by defining tolerance levels for data protection or security in different scenarios, often in a reference table that can be reused for other risk assessments.
nb: Virksomhetens risikoappetitt dokumenteres ved å sette toleransenivå for ulike kategorier eller scenarier på personvern og sikkerhet, ofte i en hjelpetabell som kan gjenbrukes i andre risikovurderinger.

source: For example, the software should, using clear and plain language, provide information about what personal data will be used for.
nb: For eksempel skal programvaren med et enkelt og forståelig språk gir informasjon om hva personopplysninger skal brukes til.

source: One example would be to have a data protection or privacy policy describing how the software ensures the enforceability of the data subject’s rights, how you comply with data protection regulation, and what technical measures are in place to protect personal data.
nb: Et eksempel er å ha en personvernerklæring som beskriver hvordan programvaren ivaretar de registrertes personvern, hvordan dere etterlever personvernregelverket og hvilke tekniske tiltak som er på plass for å beskytte personvernet.

source: Apply by downloading and submitting the application form to.
nb: Du kan søke om å delta ved å laste ned, fylle inn og sende søknadskjemaet til.

source: certain methodologies in robotics (such as control, sensors, and integration with other technologies in cyber-physical systems).
nb: enkelte metoder innen robotikk (som kontroll, sensorer og integrasjon med andre teknologier i cyber-fysiske systemer).

source: Has NAV chosen good / correct justice goals for the outcome, and are they in accordance with legal requirements?
nb: Har NAV valgt gode/riktige rettferdighetsmål for utfallet, og er de i overenstemmelse med lovkrav?

source: Examples of such tools can be found on
nb: Eksempler på dette kan man finne på

source: Requirements for artificial intelligence to be transparent and explicit also follow from both Article 5 of the General Data Protection Regulation and from ethical principles for artificial intelligence.
nb: Også kravet til at kunstig intelligens skal være gjennomsiktig og forklarbar følger både av personvernforordningen artikkel 5 og etiske prinsipper for kunstig intelligens.

source: This guide describes how to comply with these requirements.
nb: I denne veilederen beskriver vi hvordan dette kravet kan ivaretas.

source: The project plan for the sandbox work has been laid out.
nb: Prosjektplanen for sandkassearbeidet er lagt.

source: Have different levels of scanning, such as for developers, for security advisors, and
nb: Ha forskjellige nivå av skanning, eksempelvis for utviklere, sikkerhetsrådgivere og den som er

source: Details of certain objects are also recorded in SIS II, for example cars, ­ rearms, boats, and identity documents that may have been lost or stolen or used to carry out a crime.
nb: Dette gjelder blant annet biler, skytevåpen, båter og identi­fikasjonsdokumenter som kan være mistet, stjålet eller benyttet til å utføre en straffbar handling.

source: o Use real data only for quality assurance when the software is implemented in the
nb: o Bruk reelle data kun ved kvalitetssikring når programvaren er implementert i

source: It is the company’s management that determines the degree of risk the company is willing to take in different scenarios.
nb: Det er virksomhetens ledelse som avgjør hvor stor risiko (risikoappetitt) virksomheten skal ta ved ulike scenarier.

source: Disable unsafe functions and modules
nb: Ugyldiggjør utrygge funksjoner og moduler

source: The procedures should include error debugging, performance improvements, updates, and patching, of both the software and third-party components.
nb: Rutinene bør også omfatte feilretting, ytelsesforbedringer og oppdatering og patching av både programvare og tredjepartskomponenter.

source: Limit the amount of information processed on units or in areas with lower trust and security assurance.
nb: Begrens mengden av informasjon som behandles på enheter og områder med lavere tillit.

source: The status of all active tasks is established at a morning meeting for the team, where challenges that have arisen relating to, e.g. data protection can be discussed.
nb: Status på alle aktive oppgaver gjøres på morgenmøtet for teamet og utfordringer som har dukket opp rundt for eksempel personvern diskuteres.

source: between service providers and their subcontractors, or
nb: mellom leverandører og underleverandører, eller

source: submit questions or complaints relating to data protection and security.
nb: å kunne sende inn spørsmål eller klager knyttet til personvern og sikkerhet.

source: You can also read more about this topic in a downloadable PDF found here:
nb: Du kan også lese mer om temaet i nedlastbar PDF i

source: Tracking from one website to another should be disabled by default.
nb: Sporing fra et nettsted til et annet skal være deaktivert som standard.

source: This also includes artificial intelligence, profiling, and automated decision-making.
nb: Dette omfatter også kunstig intelligens, profilering og automatisert behandling.

source: - The municipality has breached the data protection regulations requirements relating to confidentiality, and the matter concerns both procedural and technical failings.
nb: - Avvikene gjelder brudd på personopplysningsregelverkets krav om konfidensialitet, og omfatter både rutinesvikt og teknisk svikt.

source: Furthermore, accessing privacy information often entails a considerable search effort by the user.
nb: for formålet med politiattesten, men ikke utover det tidspunkt vedkommende slutter i den stillingen som ga grunnlaget for vandelskontroll.

source: Investigate cookie and session management, such as how login and access
nb: Undersøk cookie og sesjonshåndtering, for eksempel hvordan innlogging og

source: - It will be exciting to join the sandbox, and contribute so that maybe others can learn a little from what we do as well, says Lars Sutterud, data scientist at NAV.
nb: - Det blir spennende å bli med i sandkassen, og bidra til at kanskje andre kan lære litt av det vi gjør også, sier Lars Sutterud, data scientist i NAV.

source: within and outside the organization.
nb: Arbeidsgruppen er likevel av den oppfatning av at den

source: At the same time, they have worked with machine learning in other parts of the service offering, including identifying suspicious e-mails.
nb: Samtidig har de jobbet med maskinlæring i andre deler av tjenestetilbudet, blant annet til å identifisere mistenkelige e-poster.

source: Ålesund municipality fined for use of Strava
nb: Gebyr til Ålesund kommune for bruk av Strava

source: abnormal activity, traffic, security incidents, and data breaches.
nb: unormal og avvikende aktivitet, trafikk, sikkerhetshendelser og avvik.

source: Personal data which are to be transferred between two or more locations by means of digital communication.
nb: Personopplysninger som skal overføres mellom to eller flere lokasjoner ved bruk av datakommunikasjon.

source: Keep less highly trusted units and areas separate from more highly trusted units.
nb: Skill enheter og områder med lavere tillit fra enheter med høyere tillit.

source: Use multiple languages if necessary.
nb: Bruk flere språk dersom det er nødvendig.

source: In it, Age Labs and the Norwegian Data Protection Authority have focused on the issues they will be working on in the sandbox.
nb: I den har Age Labs og Datatilsynet spisset seg inn på hvilke problemstillinger de skal jobbe med i sandkassa.

source: Reasons for issuing an alert are:
nb: Et varsel kan sendes ut for å:

source: Measures to achieve this can include access control to tables, splitting database tables, distinguishing between components, units and areas with a high level of trust and those with a lower level of trust, and dividing access to specific areas according to necessity.
nb: Tiltak for å oppnå dette kan være tilgangsstyring til tabeller, splitting av databasetabeller, skille mellom enheter med høy tillit og lav tillit, skille tilgang til områder i forhold til behov.

source: Internal requirements may relate to data protection, information security, internal control, and resource management.
nb: Interne krav kan omhandle personvern, informasjonssikkerhet, internkontroll og organisering av ressurser.

source: As a Secure Hash Algorithm, the recommendation is for SHA-2 with at least 256-bit strength.
nb: Som avtrykksalgoritme anbefales SHA-2 med minst 256 bits styrke.

source: Note that personal data being logged one place is often exported to other applications and may become available to more people than those who are authorised (privilege escalation).
nb: Vær oppmerksom på at personopplysninger som logges, ofte eksporteres til andre applikasjoner og kan bli tilgjengelig for flere personer enn de som har tjenestlig behov.

source: Rows in tables should be hard to link to one another.
nb: Rader i tabeller bør være vanskelig å lenke til hverandre.

source: The Norwegian Data Protection Authority have issued a reprimand to Telenor Norge AS for inadequate protection of personal data in its voicemail function, and for failing to submit a data breach notification to the Norwegian Data Protection Authority.
nb: Vi har gitt en irettesettelse til Telenor Norge AS for manglende personopplysningssikkerhet i talepostkassefunksjonen, og for manglende avviksmelding til Datatilsynet.

source: Risk assessment is about identifying the potential consequences of different incidents or scenarios, and assessing how likely or easy it is that an unwanted incident occurs.
nb: Risikovurdering handler om å identifisere konsekvenser ved ulike hendelser eller scenarier, og vurdere hvor sannsynlig eller lett en uønsket hendelse kan inntreffe.

source: In it, data from different learning tools the students use will be collected.
nb: I den skal data fra forskjellige læringsverktøy elevene bruker samles.

source: Read more about our use of cookies in the footer (in Norwegian).
nb: Les om hvilke vi bruker og hvordan vi administrerer dem nederst på nettsiden.

source: Municipality of Asker fined
nb: Gebyr til Asker kommune

source: Norwegian DPA issues fine to Municipality of Indre Østfold
nb: Vedtak om overtredelsesgebyr til Indre Østfold kommune

source: Identify and allocate roles, responsibilities, and authority.
nb: Identifiser og fordel roller, ansvar og myndighet.

source: We consider these necessary and they are stored without prior approval.
nb: Vi har vurdert disse som nødvendige, og de lagres derfor uten foregående samtykke.

source: For example, test for default passwords, passwords stored in files, SQL injection, script injection, cross-site scripting, missing validation, unauthorised access to logs, backups, and temporary locations.
nb: Test for eksempel på standardpassord, passord i filer, SQL injection, script injection, logger, backups, tmp-områder, Cross-site scripting, manglende validation.
